InformationRegisters/ДанныеДляБАТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДанныеДляБАТ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеСканирования</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеОтправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОтправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеСканирования_стар</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтправкиФМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСканирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РезервированиеЗаказовПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РезервированиеЗаказовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД_Сообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД_Передачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД_События</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДанныеДляБАТ/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Функция ДанныеСканировки(МассивСтрок)
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	
	Для Каждого Стр Из МассивСтрок Цикл 
		ТекстовыйДокумент.ДобавитьСтроку(Строка(Стр.РезервированиеЗаказовПокупателя));
		
		Очередь = РегистрыСведений.ДанныеДляБАТ.СоздатьМенеджерЗаписи();
		Очередь.РезервированиеЗаказовПокупателя = Стр.РезервированиеЗаказовПокупателя;
		Очередь.Статус  = Стр.Статус;
		Очередь.ДатаСканирования  = Стр.ДатаСканирования;
		Очередь.Пользователь  = Стр.Пользователь;
		Очередь.ИД_Сообщения  = Стр.ИД_Сообщения;
		Очередь.ИД_Передачи  = Стр.ИД_Передачи;
		Очередь.ИД_События  = Стр.ИД_События;
		Очередь.Организация  = Стр.Организация;

		
		Очередь.Прочитать();
		Если Очередь.Выбран() Тогда
			текСтрока = Очередь.ДанныеСканирования.Получить();
			Если текСтрока = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ТекстовыйДокумент.ДобавитьСтроку(текСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат	ТекстовыйДокумент;
	
КонецФункции


&НаКлиенте
Процедура СохранитьДанныеСканирования(Команда)
	
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстовыйДокумент = ДанныеСканировки(МассивСтрок);
	ТекстовыйДокумент.Показать();
	
КонецПроцедуры
